 # Pandas Series

In [1]:
    import pandas as pd

In [2]:
lst = [2,4,5,67,56]

In [3]:
pd.Series(lst)

0     2
1     4
2     5
3    67
4    56
dtype: int64

In [4]:
lst_bool = [True, True, True, False]
pd.Series(lst_bool)

0     True
1     True
2     True
3    False
dtype: bool

In [5]:
lst_mix = ['I am in list', True, 23, 67, 23, 6]
pd.Series(lst_mix)

0    I am in list
1            True
2              23
3              67
4              23
5               6
dtype: object

In [6]:
pd.Series(5, index=[0])

0    5
dtype: int64

In [7]:
pd.Series(5, index=[0, 1, 2,3, 4])

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [8]:
pd.Series([num * 10 for num in range(10)])

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [9]:
[num * 10 for num in range(10)]

[0, 10, 20, 30, 40, 50, 60, 70, 80, 90]

In [10]:
myphnbook = {'john': '123-345-2345',
             'Alice' : '567-678-2345',
             'Bob' : '567-789-1234'
    
}
pd.Series(myphnbook)

john     123-345-2345
Alice    567-678-2345
Bob      567-789-1234
dtype: object

In [11]:
pd.read_csv('C://Users//hp//Desktop//python//gender_submission.csv')

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
5            897         0
6            898         1
7            899         0
8            900         1
9            901         0
10           902         0
11           903         0
12           904         1
13           905         0
14           906         1
15           907         1
16           908         0
17           909         0
18           910         1
19           911         1
20           912         0
21           913         0
22           914         1
23           915         0
24           916         1
25           917         0
26           918         1
27           919         0
28           920         0
29           921         0
..           ...       ...
388         1280         0
389         1281         0
390         1282         0
391         1283         1
392         1284         0
393         1285         0
394         1286         0
395         1287         1
396         1288         0
397         1289         1
398         1290         0
399         1291         0
400         1292         1
401         1293         0
402         1294         1
403         1295         0
404         1296         0
405         1297         0
406         1298         0
407         1299         0
408         1300         1
409         1301         1
410         1302         1
411         1303         1
412         1304         1
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [12]:
type(pd.read_csv('C://Users//hp//Desktop//python//gender_submission.csv'))

pandas.core.frame.DataFrame

In [13]:
pd.read_csv('C://Users//hp//Desktop//python//gender_submission.csv', header = None)

               0         1
0    PassengerId  Survived
1            892         0
2            893         1
3            894         0
4            895         0
5            896         1
6            897         0
7            898         1
8            899         0
9            900         1
10           901         0
11           902         0
12           903         0
13           904         1
14           905         0
15           906         1
16           907         1
17           908         0
18           909         0
19           910         1
20           911         1
21           912         0
22           913         0
23           914         1
24           915         0
25           916         1
26           917         0
27           918         1
28           919         0
29           920         0
..           ...       ...
389         1280         0
390         1281         0
391         1282         0
392         1283         1
393         1284         0
394         1285         0
395         1286         0
396         1287         1
397         1288         0
398         1289         1
399         1290         0
400         1291         0
401         1292         1
402         1293         0
403         1294         1
404         1295         0
405         1296         0
406         1297         0
407         1298         0
408         1299         0
409         1300         1
410         1301         1
411         1302         1
412         1303         1
413         1304         1
414         1305         0
415         1306         1
416         1307         0
417         1308         0
418         1309         0

[419 rows x 2 columns]

In [14]:
pd.read_csv('C://Users//hp//Desktop//python//gender_submission.csv', squeeze=True)

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
5            897         0
6            898         1
7            899         0
8            900         1
9            901         0
10           902         0
11           903         0
12           904         1
13           905         0
14           906         1
15           907         1
16           908         0
17           909         0
18           910         1
19           911         1
20           912         0
21           913         0
22           914         1
23           915         0
24           916         1
25           917         0
26           918         1
27           919         0
28           920         0
29           921         0
..           ...       ...
388         1280         0
389         1281         0
390         1282         0
391         1283         1
392         1284         0
393         1285         0
394         1286         0
395         1287         1
396         1288         0
397         1289         1
398         1290         0
399         1291         0
400         1292         1
401         1293         0
402         1294         1
403         1295         0
404         1296         0
405         1297         0
406         1298         0
407         1299         0
408         1300         1
409         1301         1
410         1302         1
411         1303         1
412         1304         1
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [15]:
pd.read_csv('C://Users//hp//Desktop//python//gender_submission.csv', squeeze=True)

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
5            897         0
6            898         1
7            899         0
8            900         1
9            901         0
10           902         0
11           903         0
12           904         1
13           905         0
14           906         1
15           907         1
16           908         0
17           909         0
18           910         1
19           911         1
20           912         0
21           913         0
22           914         1
23           915         0
24           916         1
25           917         0
26           918         1
27           919         0
28           920         0
29           921         0
..           ...       ...
388         1280         0
389         1281         0
390         1282         0
391         1283         1
392         1284         0
393         1285         0
394         1286         0
395         1287         1
396         1288         0
397         1289         1
398         1290         0
399         1291         0
400         1292         1
401         1293         0
402         1294         1
403         1295         0
404         1296         0
405         1297         0
406         1298         0
407         1299         0
408         1300         1
409         1301         1
410         1302         1
411         1303         1
412         1304         1
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [16]:
s = pd.read_csv('C://Users//hp//Desktop//python//gender_submission.csv', squeeze=True, usecols = ['PassengerId'])

In [17]:
type(s)

pandas.core.series.Series

# Series Attributes and Methods

In [18]:
s = pd.read_csv('C://Users//hp//Desktop//python//gender_submission.csv', squeeze=True, usecols = ['PassengerId'])

In [19]:
s

0       892
1       893
2       894
3       895
4       896
5       897
6       898
7       899
8       900
9       901
10      902
11      903
12      904
13      905
14      906
15      907
16      908
17      909
18      910
19      911
20      912
21      913
22      914
23      915
24      916
25      917
26      918
27      919
28      920
29      921
       ...
388    1280
389    1281
390    1282
391    1283
392    1284
393    1285
394    1286
395    1287
396    1288
397    1289
398    1290
399    1291
400    1292
401    1293
402    1294
403    1295
404    1296
405    1297
406    1298
407    1299
408    1300
409    1301
410    1302
411    1303
412    1304
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [20]:
s.index

RangeIndex(start=0, stop=418, step=1)

In [21]:
s.values

array([ 892,  893,  894,  895,  896,  897,  898,  899,  900,  901,  902,
        903,  904,  905,  906,  907,  908,  909,  910,  911,  912,  913,
        914,  915,  916,  917,  918,  919,  920,  921,  922,  923,  924,
        925,  926,  927,  928,  929,  930,  931,  932,  933,  934,  935,
        936,  937,  938,  939,  940,  941,  942,  943,  944,  945,  946,
        947,  948,  949,  950,  951,  952,  953,  954,  955,  956,  957,
        958,  959,  960,  961,  962,  963,  964,  965,  966,  967,  968,
        969,  970,  971,  972,  973,  974,  975,  976,  977,  978,  979,
        980,  981,  982,  983,  984,  985,  986,  987,  988,  989,  990,
        991,  992,  993,  994,  995,  996,  997,  998,  999, 1000, 1001,
       1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1011, 1012,
       1013, 1014, 1015, 1016, 1017, 1018, 1019, 1020, 1021, 1022, 1023,
       1024, 1025, 1026, 1027, 1028, 1029, 1030, 1031, 1032, 1033, 1034,
       1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043, 1044, 1045,
       1046, 1047, 1048, 1049, 1050, 1051, 1052, 1053, 1054, 1055, 1056,
       1057, 1058, 1059, 1060, 1061, 1062, 1063, 1064, 1065, 1066, 1067,
       1068, 1069, 1070, 1071, 1072, 1073, 1074, 1075, 1076, 1077, 1078,
       1079, 1080, 1081, 1082, 1083, 1084, 1085, 1086, 1087, 1088, 1089,
       1090, 1091, 1092, 1093, 1094, 1095, 1096, 1097, 1098, 1099, 1100,
       1101, 1102, 1103, 1104, 1105, 1106, 1107, 1108, 1109, 1110, 1111,
       1112, 1113, 1114, 1115, 1116, 1117, 1118, 1119, 1120, 1121, 1122,
       1123, 1124, 1125, 1126, 1127, 1128, 1129, 1130, 1131, 1132, 1133,
       1134, 1135, 1136, 1137, 1138, 1139, 1140, 1141, 1142, 1143, 1144,
       1145, 1146, 1147, 1148, 1149, 1150, 1151, 1152, 1153, 1154, 1155,
       1156, 1157, 1158, 1159, 1160, 1161, 1162, 1163, 1164, 1165, 1166,
       1167, 1168, 1169, 1170, 1171, 1172, 1173, 1174, 1175, 1176, 1177,
       1178, 1179, 1180, 1181, 1182, 1183, 1184, 1185, 1186, 1187, 1188,
       1189, 1190, 1191, 1192, 1193, 1194, 1195, 1196, 1197, 1198, 1199,
       1200, 1201, 1202, 1203, 1204, 1205, 1206, 1207, 1208, 1209, 1210,
       1211, 1212, 1213, 1214, 1215, 1216, 1217, 1218, 1219, 1220, 1221,
       1222, 1223, 1224, 1225, 1226, 1227, 1228, 1229, 1230, 1231, 1232,
       1233, 1234, 1235, 1236, 1237, 1238, 1239, 1240, 1241, 1242, 1243,
       1244, 1245, 1246, 1247, 1248, 1249, 1250, 1251, 1252, 1253, 1254,
       1255, 1256, 1257, 1258, 1259, 1260, 1261, 1262, 1263, 1264, 1265,
       1266, 1267, 1268, 1269, 1270, 1271, 1272, 1273, 1274, 1275, 1276,
       1277, 1278, 1279, 1280, 1281, 1282, 1283, 1284, 1285, 1286, 1287,
       1288, 1289, 1290, 1291, 1292, 1293, 1294, 1295, 1296, 1297, 1298,
       1299, 1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308, 1309],
      dtype=int64)

In [22]:
s.dtype

dtype('int64')

In [23]:
s.ndim

1

In [24]:
s.size

418

In [25]:
s.is_unique

True

In [26]:
s.is_monotonic_increasing

True

In [27]:
s.add_prefix('Pandas')

Pandas0       892
Pandas1       893
Pandas2       894
Pandas3       895
Pandas4       896
Pandas5       897
Pandas6       898
Pandas7       899
Pandas8       900
Pandas9       901
Pandas10      902
Pandas11      903
Pandas12      904
Pandas13      905
Pandas14      906
Pandas15      907
Pandas16      908
Pandas17      909
Pandas18      910
Pandas19      911
Pandas20      912
Pandas21      913
Pandas22      914
Pandas23      915
Pandas24      916
Pandas25      917
Pandas26      918
Pandas27      919
Pandas28      920
Pandas29      921
             ...
Pandas388    1280
Pandas389    1281
Pandas390    1282
Pandas391    1283
Pandas392    1284
Pandas393    1285
Pandas394    1286
Pandas395    1287
Pandas396    1288
Pandas397    1289
Pandas398    1290
Pandas399    1291
Pandas400    1292
Pandas401    1293
Pandas402    1294
Pandas403    1295
Pandas404    1296
Pandas405    1297
Pandas406    1298
Pandas407    1299
Pandas408    1300
Pandas409    1301
Pandas410    1302
Pandas411    1303
Pandas412    1304
Pandas413    1305
Pandas414    1306
Pandas415    1307
Pandas416    1308
Pandas417    1309
Name: PassengerId, Length: 418, dtype: int64

In [28]:
s.add_suffix('Pandas')

0Pandas       892
1Pandas       893
2Pandas       894
3Pandas       895
4Pandas       896
5Pandas       897
6Pandas       898
7Pandas       899
8Pandas       900
9Pandas       901
10Pandas      902
11Pandas      903
12Pandas      904
13Pandas      905
14Pandas      906
15Pandas      907
16Pandas      908
17Pandas      909
18Pandas      910
19Pandas      911
20Pandas      912
21Pandas      913
22Pandas      914
23Pandas      915
24Pandas      916
25Pandas      917
26Pandas      918
27Pandas      919
28Pandas      920
29Pandas      921
             ...
388Pandas    1280
389Pandas    1281
390Pandas    1282
391Pandas    1283
392Pandas    1284
393Pandas    1285
394Pandas    1286
395Pandas    1287
396Pandas    1288
397Pandas    1289
398Pandas    1290
399Pandas    1291
400Pandas    1292
401Pandas    1293
402Pandas    1294
403Pandas    1295
404Pandas    1296
405Pandas    1297
406Pandas    1298
407Pandas    1299
408Pandas    1300
409Pandas    1301
410Pandas    1302
411Pandas    1303
412Pandas    1304
413Pandas    1305
414Pandas    1306
415Pandas    1307
416Pandas    1308
417Pandas    1309
Name: PassengerId, Length: 418, dtype: int64

In [29]:
s.sum()

460009

In [30]:
s

0       892
1       893
2       894
3       895
4       896
5       897
6       898
7       899
8       900
9       901
10      902
11      903
12      904
13      905
14      906
15      907
16      908
17      909
18      910
19      911
20      912
21      913
22      914
23      915
24      916
25      917
26      918
27      919
28      920
29      921
       ...
388    1280
389    1281
390    1282
391    1283
392    1284
393    1285
394    1286
395    1287
396    1288
397    1289
398    1290
399    1291
400    1292
401    1293
402    1294
403    1295
404    1296
405    1297
406    1298
407    1299
408    1300
409    1301
410    1302
411    1303
412    1304
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [31]:
s.idxmax()

417

In [32]:
max(s)

1309

In [33]:
s.idxmin()

0

In [34]:
shed = s.head()

In [35]:
shed

0    892
1    893
2    894
3    895
4    896
Name: PassengerId, dtype: int64

In [36]:
s.tail()

413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, dtype: int64

In [37]:
s.head(2)

0    892
1    893
Name: PassengerId, dtype: int64

In [38]:
s.tail(10)

408    1300
409    1301
410    1302
411    1303
412    1304
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, dtype: int64

In [39]:
s.mean

<bound method Series.mean of 0       892
1       893
2       894
3       895
4       896
5       897
6       898
7       899
8       900
9       901
10      902
11      903
12      904
13      905
14      906
15      907
16      908
17      909
18      910
19      911
20      912
21      913
22      914
23      915
24      916
25      917
26      918
27      919
28      920
29      921
       ...
388    1280
389    1281
390    1282
391    1283
392    1284
393    1285
394    1286
395    1287
396    1288
397    1289
398    1290
399    1291
400    1292
401    1293
402    1294
403    1295
404    1296
405    1297
406    1298
407    1299
408    1300
409    1301
410    1302
411    1303
412    1304
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64>

In [40]:
s.product()

0

In [41]:
s.std()

120.81045760473994

In [42]:
s.shape

(418,)

In [43]:
s.describe()

count     418.000000
mean     1100.500000
std       120.810458
min       892.000000
25%       996.250000
50%      1100.500000
75%      1204.750000
max      1309.000000
Name: PassengerId, dtype: float64

#    # Label Indexing

In [44]:
import pandas as pd
temp = [30, 32, 33, 35, 36, 37, 34, 32, 30, 32, 28 , 28]
months = ['jan', 'feb', 'march', 'april', 'may', 'june', 'july', 'aug', 'sept', 'oct', 'nov', 'dec']

In [45]:
pd.Series(temp)

0     30
1     32
2     33
3     35
4     36
5     37
6     34
7     32
8     30
9     32
10    28
11    28
dtype: int64

In [46]:
pd.Series(temp, months)

jan      30
feb      32
march    33
april    35
may      36
june     37
july     34
aug      32
sept     30
oct      32
nov      28
dec      28
dtype: int64

In [47]:
pd.Series(data = temp, index = months)

jan      30
feb      32
march    33
april    35
may      36
june     37
july     34
aug      32
sept     30
oct      32
nov      28
dec      28
dtype: int64

In [48]:
    pd.Series( index = months, data = temp)

jan      30
feb      32
march    33
april    35
may      36
june     37
july     34
aug      32
sept     30
oct      32
nov      28
dec      28
dtype: int64

In [49]:
s =  pd.Series( index = months, data = temp)

In [50]:
type(s)

pandas.core.series.Series

In [51]:
    s.index

Index(['jan', 'feb', 'march', 'april', 'may', 'june', 'july', 'aug', 'sept',
       'oct', 'nov', 'dec'],
      dtype='object')

# sort_value, sort_index, Inplace parameter

In [52]:
temp = [30, 32, 33, 35, 36, 37, 34, 32, 30, 32, 28 , 28]
months = ['jan', 'feb', 'march', 'april', 'may', 'june', 'july', 'aug', 'sept', 'oct', 'nov', 'dec']

In [53]:
s1 = pd.Series(temp, months)

In [54]:
s1

jan      30
feb      32
march    33
april    35
may      36
june     37
july     34
aug      32
sept     30
oct      32
nov      28
dec      28
dtype: int64

In [55]:
s1.sort_values()

nov      28
dec      28
jan      30
sept     30
feb      32
aug      32
oct      32
march    33
july     34
april    35
may      36
june     37
dtype: int64

In [56]:
s1.sort_values(ascending = False)

june     37
may      36
april    35
july     34
march    33
oct      32
aug      32
feb      32
sept     30
jan      30
dec      28
nov      28
dtype: int64

In [57]:
s1

jan      30
feb      32
march    33
april    35
may      36
june     37
july     34
aug      32
sept     30
oct      32
nov      28
dec      28
dtype: int64

In [58]:
s1.sort_values(inplace=True)

s1

In [59]:
s1

nov      28
dec      28
jan      30
sept     30
feb      32
aug      32
oct      32
march    33
july     34
april    35
may      36
june     37
dtype: int64

In [60]:
s1.index

Index(['nov', 'dec', 'jan', 'sept', 'feb', 'aug', 'oct', 'march', 'july',
       'april', 'may', 'june'],
      dtype='object')

In [61]:
s1.sort_index()

april    35
aug      32
dec      28
feb      32
jan      30
july     34
june     37
march    33
may      36
nov      28
oct      32
sept     30
dtype: int64

In [62]:
s1.sort_index(ascending = False)

sept     30
oct      32
nov      28
may      36
march    33
june     37
july     34
jan      30
feb      32
dec      28
aug      32
april    35
dtype: int64

In [63]:
s1

nov      28
dec      28
jan      30
sept     30
feb      32
aug      32
oct      32
march    33
july     34
april    35
may      36
june     37
dtype: int64

In [64]:
s1.sort_index(inplace = True)

In [65]:
s1

april    35
aug      32
dec      28
feb      32
jan      30
july     34
june     37
march    33
may      36
nov      28
oct      32
sept     30
dtype: int64

# Extract value from series

In [66]:
temp = [30, 32, 33, 35, 36, 37, 34, 32, 30, 32, 28 , 28]
months = ['jan', 'feb', 'march', 'april', 'may', 'june', 'july', 'aug', 'sept', 'oct', 'nov', 'dec']

In [67]:
s1 = pd.Series(temp, months)

In [68]:
s1

jan      30
feb      32
march    33
april    35
may      36
june     37
july     34
aug      32
sept     30
oct      32
nov      28
dec      28
dtype: int64

In [69]:
s1[0]

30

In [70]:
s1[5]

37

In [71]:
s1[2:5]

march    33
april    35
may      36
dtype: int64

In [72]:
s1[[3,5,9]]

april    35
june     37
oct      32
dtype: int64

#

In [73]:
s1[-1]

28

In [74]:
s1[-2]

28

In [75]:
s1[-5 : -2]

aug     32
sept    30
oct     32
dtype: int64

In [76]:
s1

jan      30
feb      32
march    33
april    35
may      36
june     37
july     34
aug      32
sept     30
oct      32
nov      28
dec      28
dtype: int64

In [77]:
s1['aug']

32

In [78]:
s1[['may', 'nov', 'dec']]

may    36
nov    28
dec    28
dtype: int64

In [79]:
s1[-1]

28

In [80]:
s = pd.Series([1,2,3,4,5])

In [81]:
s[0:2]

0    1
1    2
dtype: int64

In [82]:
s[2:3]

2    3
dtype: int64

In [83]:
s[2:]

2    3
3    4
4    5
dtype: int64

In [84]:
s[1:3]

1    2
2    3
dtype: int64

In [85]:
max(s)

5

In [86]:
sorted(s)[-1]

5

In [87]:
sorted(s)[4]

5

In [88]:
sorted(s)[0]

1

In [89]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [90]:
s1.unique()

array([30, 32, 33, 35, 36, 37, 34, 28], dtype=int64)

In [91]:
s1.value_counts()

32    3
30    2
28    2
37    1
36    1
35    1
34    1
33    1
dtype: int64

In [92]:
temp = [30, 32, 33, 35, 36, 37, 34, 32, 30, 32, 28 , 28]
months = ['jan', 'feb', 'march', 'april', 'may', 'june', 'july', 'aug', 'sept', 'oct', 'nov', 'dec']

In [93]:
s1 = pd.Series(temp, months)

In [94]:
s1

jan      30
feb      32
march    33
april    35
may      36
june     37
july     34
aug      32
sept     30
oct      32
nov      28
dec      28
dtype: int64

 #F=C * 1.8 +32

In [96]:
def ConvertTemp(C):
    return ((C * 1.8) +32)

In [97]:
ConvertTemp(s1)

jan      86.0
feb      89.6
march    91.4
april    95.0
may      96.8
june     98.6
july     93.2
aug      89.6
sept     86.0
oct      89.6
nov      82.4
dec      82.4
dtype: float64

In [98]:
s1.apply(ConvertTemp)

jan      86.0
feb      89.6
march    91.4
april    95.0
may      96.8
june     98.6
july     93.2
aug      89.6
sept     86.0
oct      89.6
nov      82.4
dec      82.4
dtype: float64

In [99]:
s1

jan      30
feb      32
march    33
april    35
may      36
june     37
july     34
aug      32
sept     30
oct      32
nov      28
dec      28
dtype: int64

In [100]:
mapobj = {30 : 300, 32:340, 28:200}

In [101]:
s1.map(mapobj)

jan      300.0
feb      340.0
march      NaN
april      NaN
may        NaN
june       NaN
july       NaN
aug      340.0
sept     300.0
oct      340.0
nov      200.0
dec      200.0
dtype: float64

# Some string methods

# Replace, Stop, word remove, startwith, ends with

In [9]:
'I am learning pandas'

'I am learning pandas'

In [10]:
'I am learning pandas'.replace('I am', 'You are')

'You are learning pandas'

In [1]:
import pandas as pd

In [2]:
a = 'I am learning pandas  '

In [3]:
a

'I am learning pandas  '

In [4]:
#pd.read_csv('C://Users//hp//Desktop//python2//weathern', sep='\t')

In [5]:
a.upper()

'I AM LEARNING PANDAS  '

In [6]:
a.lower()

'i am learning pandas  '

In [7]:
a.strip()

'I am learning pandas'

In [8]:
a.replace(' ', '...')

'I...am...learning...pandas......'

In [9]:
a.replace(' ', '')

'Iamlearningpandas'

In [10]:
mystr = "GreyAtom : course of data science : At Andheri"

In [11]:
mystr.split()

['GreyAtom', ':', 'course', 'of', 'data', 'science', ':', 'At', 'Andheri']

In [12]:
mystr.split(':')

['GreyAtom ', ' course of data science ', ' At Andheri']

In [13]:
loan= pd.read_csv('loan_prediction_train.csv')

In [14]:
loan.head()

,UniqueID,disbursed_amount,asset_cost,ltv,branch_id,supplier_id,manufacturer_id,Current_pincode_ID,Date.of.Birth,Employment.Type,...,SEC.SANCTIONED.AMOUNT,SEC.DISBURSED.AMOUNT,PRIMARY.INSTAL.AMT,SEC.INSTAL.AMT,NEW.ACCTS.IN.LAST.SIX.MONTHS,DELINQUENT.ACCTS.IN.LAST.SIX.MONTHS,AVERAGE.ACCT.AGE,CREDIT.HISTORY.LENGTH,NO.OF_INQUIRIES,loan_default
0,420825,50578,58400,89.55,67,22807,45,1441,01-01-84,Salaried,...,0,0,0,0,0,0,0yrs 0mon,0yrs 0mon,0,0
1,537409,47145,65550,73.23,67,22807,45,1502,31-07-85,Self employed,...,0,0,1991,0,0,1,1yrs 11mon,1yrs 11mon,0,1
2,417566,53278,61360,89.63,67,22807,45,1497,24-08-85,Self employed,...,0,0,0,0,0,0,0yrs 0mon,0yrs 0mon,0,0
3,624493,57513,66113,88.48,67,22807,45,1501,30-12-93,Self employed,...,0,0,31,0,0,0,0yrs 8mon,1yrs 3mon,1,1
4,539055,52378,60300,88.39,67,22807,45,1495,09-12-77,Self employed,...,0,0,0,0,0,0,0yrs 0mon,0yrs 0mon,1,1

In [15]:
loan_grpby = loan.groupby('Employment.Type')

In [16]:
loan_grpby.get_group('Salaried')
len(loan_grpby.get_group('Self employed'))

127635

In [17]:
loan_grpby.size()

Employment.Type
Salaried          97858
Self employed    127635
dtype: int64

In [18]:
loan_grpby.first()

,UniqueID,disbursed_amount,asset_cost,ltv,branch_id,supplier_id,manufacturer_id,Current_pincode_ID,Date.of.Birth,DisbursalDate,...,SEC.SANCTIONED.AMOUNT,SEC.DISBURSED.AMOUNT,PRIMARY.INSTAL.AMT,SEC.INSTAL.AMT,NEW.ACCTS.IN.LAST.SIX.MONTHS,DELINQUENT.ACCTS.IN.LAST.SIX.MONTHS,AVERAGE.ACCT.AGE,CREDIT.HISTORY.LENGTH,NO.OF_INQUIRIES,loan_default
Employment.Type,,,,,,,,,,,,,,,,,,,,,
Salaried,420825,50578,58400,89.55,67,22807,45,1441,01-01-84,03-08-18,...,0,0,0,0,0,0,0yrs 0mon,0yrs 0mon,0,0
Self employed,537409,47145,65550,73.23,67,22807,45,1502,31-07-85,26-09-18,...,0,0,1991,0,0,1,1yrs 11mon,1yrs 11mon,0,1

In [19]:
loan_grpby.last()

,UniqueID,disbursed_amount,asset_cost,ltv,branch_id,supplier_id,manufacturer_id,Current_pincode_ID,Date.of.Birth,DisbursalDate,...,SEC.SANCTIONED.AMOUNT,SEC.DISBURSED.AMOUNT,PRIMARY.INSTAL.AMT,SEC.INSTAL.AMT,NEW.ACCTS.IN.LAST.SIX.MONTHS,DELINQUENT.ACCTS.IN.LAST.SIX.MONTHS,AVERAGE.ACCT.AGE,CREDIT.HISTORY.LENGTH,NO.OF_INQUIRIES,loan_default
Employment.Type,,,,,,,,,,,,,,,,,,,,,
Salaried,630213,75751,116009,66.81,77,22186,86,2299,18-02-84,27-10-18,...,0,0,0,0,0,0,0yrs 0mon,0yrs 0mon,0,0
Self employed,606141,73651,100600,74.95,34,23775,51,990,05-12-88,23-10-18,...,0,0,1565,0,0,0,0yrs 6mon,0yrs 6mon,0,0

# sum, mean, max min method

In [22]:
housing = pd.read_csv('housing.csv')

In [23]:
housing.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address,State/District
0,79545.45857,5.682861,7.009188,4.09,23086.80050,1.059034e+06,"208 Michael Ferry Apt. 674\r\nLaurabury, NE 37...",Alabama
1,79248.64245,6.002900,6.730821,3.09,40173.07217,1.505891e+06,"188 Johnson Views Suite 079\r\nLake Kathleen, ...",Alaska
2,61287.06718,5.865890,8.512727,5.13,36882.15940,1.058988e+06,"9127 Elizabeth Stravenue\r\nDanieltown, WI 064...",Arizona
3,63345.24005,7.188236,5.586729,3.26,34310.24283,1.260617e+06,USS Barnett\r\nFPO AP 44820,Arkansas
4,59982.19723,5.040555,7.839388,4.23,26354.10947,6.309435e+05,USNS Raymond\r\nFPO AE 09386,California

In [25]:
housing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 8 columns):
Avg. Area Income                14 non-null float64
Avg. Area House Age             14 non-null float64
Avg. Area Number of Rooms       14 non-null float64
Avg. Area Number of Bedrooms    14 non-null float64
Area Population                 14 non-null float64
Price                           14 non-null float64
Address                         14 non-null object
State/District                  14 non-null object
dtypes: float64(6), object(2)
memory usage: 976.0+ bytes

In [26]:
housing['State/District'].nunique()

14

In [28]:
housing[housing['State/District'] == 'California']

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address,State/District
4,59982.19723,5.040555,7.839388,4.23,26354.10947,630943.4893,USNS Raymond\r\nFPO AE 09386,California

In [31]:
housing_grpby = housing.groupby('State/District')

In [32]:
housing_grpby.get_group('Alaska')

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address,State/District
1,79248.64245,6.0029,6.730821,3.09,40173.07217,1505890.915,"188 Johnson Views Suite 079\r\nLake Kathleen, ...",Alaska

In [33]:
type(housing_grpby.get_group('Alaska'))

pandas.core.frame.DataFrame

In [34]:
len(housing_grpby.get_group('Alaska'))

1

In [35]:
housing_grpby.size()

State/District
Alabama                 1
Alaska                  1
Arizona                 1
Arkansas                1
California              1
Colorado                1
Connecticut             1
Delaware                1
District of Columbia    1
Florida                 1
Georgia                 1
Hawaii                  1
Idaho                   1
Illinois                1
dtype: int64

In [36]:
housing_grpby.first()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
State/District,,,,,,,
Alabama,79545.45857,5.682861,7.009188,4.09,23086.80050,1.059034e+06,"208 Michael Ferry Apt. 674\r\nLaurabury, NE 37..."
Alaska,79248.64245,6.002900,6.730821,3.09,40173.07217,1.505891e+06,"188 Johnson Views Suite 079\r\nLake Kathleen, ..."
Arizona,61287.06718,5.865890,8.512727,5.13,36882.15940,1.058988e+06,"9127 Elizabeth Stravenue\r\nDanieltown, WI 064..."
Arkansas,63345.24005,7.188236,5.586729,3.26,34310.24283,1.260617e+06,USS Barnett\r\nFPO AP 44820
California,59982.19723,5.040555,7.839388,4.23,26354.10947,6.309435e+05,USNS Raymond\r\nFPO AE 09386
Colorado,80175.75416,4.988408,6.104512,4.04,26748.42842,1.068138e+06,"06039 Jennifer Islands Apt. 443\r\nTracyport, ..."
Connecticut,64698.46343,6.025336,8.147760,3.41,60828.24909,1.502056e+06,"4759 Daniel Shoals Suite 442\r\nNguyenburgh, C..."
Delaware,78394.33928,6.989780,6.620478,2.42,36516.35897,1.573937e+06,"972 Joyce Viaduct\r\nLake William, TN 17778-6483"
District of Columbia,59927.66081,5.362126,6.393121,2.30,29387.39600,7.988695e+05,USS Gilbert\r\nFPO AA 20957
Florida,81885.92718,4.423672,8.167688,6.10,40149.96575,1.545155e+06,Unit 9446 Box 0958\r\nDPO AE 97025
Georgia,80527.47208,8.093513,5.042747,4.10,47224.35984,1.707046e+06,"6368 John Motorway Suite 700\r\nJanetbury, NM ..."
Hawaii,50593.69550,4.496513,7.467627,4.49,34343.99189,6.637324e+05,"911 Castillo Park Apt. 717\r\nDavisborough, PW..."
Idaho,39033.80924,7.671755,7.250029,3.10,39220.36147,1.042814e+06,"209 Natasha Stream Suite 961\r\nHuffmanland, N..."
Illinois,73163.66344,6.919535,5.993188,2.27,32326.12314,1.291332e+06,"829 Welch Track Apt. 992\r\nNorth John, AR 265..."

In [37]:
housing_grpby.last()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
State/District,,,,,,,
Alabama,79545.45857,5.682861,7.009188,4.09,23086.80050,1.059034e+06,"208 Michael Ferry Apt. 674\r\nLaurabury, NE 37..."
Alaska,79248.64245,6.002900,6.730821,3.09,40173.07217,1.505891e+06,"188 Johnson Views Suite 079\r\nLake Kathleen, ..."
Arizona,61287.06718,5.865890,8.512727,5.13,36882.15940,1.058988e+06,"9127 Elizabeth Stravenue\r\nDanieltown, WI 064..."
Arkansas,63345.24005,7.188236,5.586729,3.26,34310.24283,1.260617e+06,USS Barnett\r\nFPO AP 44820
California,59982.19723,5.040555,7.839388,4.23,26354.10947,6.309435e+05,USNS Raymond\r\nFPO AE 09386
Colorado,80175.75416,4.988408,6.104512,4.04,26748.42842,1.068138e+06,"06039 Jennifer Islands Apt. 443\r\nTracyport, ..."
Connecticut,64698.46343,6.025336,8.147760,3.41,60828.24909,1.502056e+06,"4759 Daniel Shoals Suite 442\r\nNguyenburgh, C..."
Delaware,78394.33928,6.989780,6.620478,2.42,36516.35897,1.573937e+06,"972 Joyce Viaduct\r\nLake William, TN 17778-6483"
District of Columbia,59927.66081,5.362126,6.393121,2.30,29387.39600,7.988695e+05,USS Gilbert\r\nFPO AA 20957
Florida,81885.92718,4.423672,8.167688,6.10,40149.96575,1.545155e+06,Unit 9446 Box 0958\r\nDPO AE 97025
Georgia,80527.47208,8.093513,5.042747,4.10,47224.35984,1.707046e+06,"6368 John Motorway Suite 700\r\nJanetbury, NM ..."
Hawaii,50593.69550,4.496513,7.467627,4.49,34343.99189,6.637324e+05,"911 Castillo Park Apt. 717\r\nDavisborough, PW..."
Idaho,39033.80924,7.671755,7.250029,3.10,39220.36147,1.042814e+06,"209 Natasha Stream Suite 961\r\nHuffmanland, N..."
Illinois,73163.66344,6.919535,5.993188,2.27,32326.12314,1.291332e+06,"829 Welch Track Apt. 992\r\nNorth John, AR 265..."

In [38]:
len(housing_grpby.first())

14

In [39]:
len(housing_grpby.last())

14

In [40]:
housing_grpby.sum()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price
State/District,,,,,,
Alabama,79545.45857,5.682861,7.009188,4.09,23086.80050,1.059034e+06
Alaska,79248.64245,6.002900,6.730821,3.09,40173.07217,1.505891e+06
Arizona,61287.06718,5.865890,8.512727,5.13,36882.15940,1.058988e+06
Arkansas,63345.24005,7.188236,5.586729,3.26,34310.24283,1.260617e+06
California,59982.19723,5.040555,7.839388,4.23,26354.10947,6.309435e+05
Colorado,80175.75416,4.988408,6.104512,4.04,26748.42842,1.068138e+06
Connecticut,64698.46343,6.025336,8.147760,3.41,60828.24909,1.502056e+06
Delaware,78394.33928,6.989780,6.620478,2.42,36516.35897,1.573937e+06
District of Columbia,59927.66081,5.362126,6.393121,2.30,29387.39600,7.988695e+05
Florida,81885.92718,4.423672,8.167688,6.10,40149.96575,1.545155e+06
Georgia,80527.47208,8.093513,5.042747,4.10,47224.35984,1.707046e+06
Hawaii,50593.69550,4.496513,7.467627,4.49,34343.99189,6.637324e+05
Idaho,39033.80924,7.671755,7.250029,3.10,39220.36147,1.042814e+06
Illinois,73163.66344,6.919535,5.993188,2.27,32326.12314,1.291332e+06

In [41]:
housing_grpby.sum()['Price']

State/District
Alabama                 1.059034e+06
Alaska                  1.505891e+06
Arizona                 1.058988e+06
Arkansas                1.260617e+06
California              6.309435e+05
Colorado                1.068138e+06
Connecticut             1.502056e+06
Delaware                1.573937e+06
District of Columbia    7.988695e+05
Florida                 1.545155e+06
Georgia                 1.707046e+06
Hawaii                  6.637324e+05
Idaho                   1.042814e+06
Illinois                1.291332e+06
Name: Price, dtype: float64

In [42]:
housing_grpby.mean()['Price']

State/District
Alabama                 1.059034e+06
Alaska                  1.505891e+06
Arizona                 1.058988e+06
Arkansas                1.260617e+06
California              6.309435e+05
Colorado                1.068138e+06
Connecticut             1.502056e+06
Delaware                1.573937e+06
District of Columbia    7.988695e+05
Florida                 1.545155e+06
Georgia                 1.707046e+06
Hawaii                  6.637324e+05
Idaho                   1.042814e+06
Illinois                1.291332e+06
Name: Price, dtype: float64

In [43]:
housing.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address,State/District
0,79545.45857,5.682861,7.009188,4.09,23086.80050,1.059034e+06,"208 Michael Ferry Apt. 674\r\nLaurabury, NE 37...",Alabama
1,79248.64245,6.002900,6.730821,3.09,40173.07217,1.505891e+06,"188 Johnson Views Suite 079\r\nLake Kathleen, ...",Alaska
2,61287.06718,5.865890,8.512727,5.13,36882.15940,1.058988e+06,"9127 Elizabeth Stravenue\r\nDanieltown, WI 064...",Arizona
3,63345.24005,7.188236,5.586729,3.26,34310.24283,1.260617e+06,USS Barnett\r\nFPO AP 44820,Arkansas
4,59982.19723,5.040555,7.839388,4.23,26354.10947,6.309435e+05,USNS Raymond\r\nFPO AE 09386,California

In [47]:
housing_grpby.agg(['sum', 'mean'])[['Area Population', 'Price']]

                     Area Population                      Price
                                 sum         mean           sum          mean
State/District
Alabama                  23086.80050  23086.80050  1.059034e+06  1.059034e+06
Alaska                   40173.07217  40173.07217  1.505891e+06  1.505891e+06
Arizona                  36882.15940  36882.15940  1.058988e+06  1.058988e+06
Arkansas                 34310.24283  34310.24283  1.260617e+06  1.260617e+06
California               26354.10947  26354.10947  6.309435e+05  6.309435e+05
Colorado                 26748.42842  26748.42842  1.068138e+06  1.068138e+06
Connecticut              60828.24909  60828.24909  1.502056e+06  1.502056e+06
Delaware                 36516.35897  36516.35897  1.573937e+06  1.573937e+06
District of Columbia     29387.39600  29387.39600  7.988695e+05  7.988695e+05
Florida                  40149.96575  40149.96575  1.545155e+06  1.545155e+06
Georgia                  47224.35984  47224.35984  1.707046e+06  1.707046e+06
Hawaii                   34343.99189  34343.99189  6.637324e+05  6.637324e+05
Idaho                    39220.36147  39220.36147  1.042814e+06  1.042814e+06
Illinois                 32326.12314  32326.12314  1.291332e+06  1.291332e+06

In [48]:
requirement = {'Area Population':'mean','Price' :'sum'}
housing_grpby.agg(requirement)

                      Area Population         Price
State/District
Alabama                   23086.80050  1.059034e+06
Alaska                    40173.07217  1.505891e+06
Arizona                   36882.15940  1.058988e+06
Arkansas                  34310.24283  1.260617e+06
California                26354.10947  6.309435e+05
Colorado                  26748.42842  1.068138e+06
Connecticut               60828.24909  1.502056e+06
Delaware                  36516.35897  1.573937e+06
District of Columbia      29387.39600  7.988695e+05
Florida                   40149.96575  1.545155e+06
Georgia                   47224.35984  1.707046e+06
Hawaii                    34343.99189  6.637324e+05
Idaho                     39220.36147  1.042814e+06
Illinois                  32326.12314  1.291332e+06